sellwanger/Monitor-SEN66/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 16MB QIO
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM: 8MB octal @ 80MHz (ESP32-S3R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# Partition table with two app slots (OTA)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- OTA security --------------------------------------------------------
# Rollback: an OTA image that boots but does not get confirmed in app_main
# (esp_ota_mark_app_valid_cancel_rollback) is reverted to the previous one on
# the next reset. Protects against uploading a .bin that boots and dies.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# App image signing WITHOUT secure boot or burning eFuses: with this, /api/ota
# REJECTS any .bin not signed with the project's private key. It is the only
# cryptographic defence against someone flashing their own firmware.
#
# Requires generating the key ONCE and keeping it OUTSIDE the repo:
#   espsecure.py generate_signing_key --version 1 secure_boot_signing_key.pem
#
# Commented out because without the key the build fails on purpose. Uncomment
# after generating it (essential before exposing the device to a network with
# untrusted devices):
#CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT=y
#CONFIG_SECURE_SIGNED_ON_UPDATE_NO_SECURE_BOOT=y
#CONFIG_SECURE_SIGNED_APPS_ECDSA_SCHEME=y
#CONFIG_SECURE_BOOT_SIGNING_KEY="secure_boot_signing_key.pem"

# 1 ms tick: smooth LVGL animations
CONFIG_FREERTOS_HZ=1000

CONFIG_COMPILER_OPTIMIZATION_PERF=y

# TLS needs contiguous internal RAM; do not waste it elsewhere
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=8192

# The web server serves a config page with many fields
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# LVGL
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_PERF_MONITOR=n
